{"config": [{"config": {"bias_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "filters": 8, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 400, 100, 1], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "activation": "elu", "trainable": true, "padding": "valid", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "filters": 16, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "activation": "elu", "trainable": true, "padding": "valid", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "activation": "elu", "trainable": true, "padding": "valid", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"rate": 0.25, "seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "units": 10, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.25, "seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "units": 2, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "trainable": true, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.4"}